Repository: yehudaTiram/perpetual-order-btn
Catalog: languages/perpetual-order-btn-*.po
Languages: he_il

source: Perpetual order, Please, login first!
he_il: הזמנה קבועה, נא להיכנס כמשתמש מזוהה קודם!

source: Order again the same predefined order
he_il: הזמן שוב את ההזמנה המוגדרת מראש

source: Write the order number
he_il: כתוב את מספר ההזמנה הקבועה

source: Perpetual order number
he_il: מספר הזמנה קבועה

source: Write the client's perpetual order number. Take it from one of his existing orders
he_il: כתוב את מספר ההזמנה הקבועה של הלקוח. בחר מאחת ההזמנות שהלקוח ביצע בעבר.

source: Perpetual order number (can be order from other customer!)
he_il: מספר ההזמנה הקבועה ללקוח (ניתן לבחור מספר הזמנה של לקוח אחר).

source: Write the client's perpetual order number. Take it from one of his existing orders.
he_il: כתוב את מספר ההזמנה הקבועה של הלקוח. בחר מאחת ההזמנות שהלקוח ביצע בעבר.

source: Duplicate
he_il: שכפל

source: Order again
he_il: הזמנה חוזרת

source: Are you sure? The perpetual order items will replace everything in you cart!
he_il: האם את/ה בטוח/ה? ההזמנה הקבועה תחליף את כל המוצרים שיש לך כבר בסל הקניות!

source: Add my perpetual order to the cart
he_il: הוסף לעגלת הקניות את ההזמנה הקבועה שלי

source: Perpetual order btn for Woocommerce
he_il: הזמנה קבועה עבור Woocommerce

source: Set a predefined perpetual order for your customers that they can activate in one click. The plugin creates a shortcode that can be assigned in any part of the site (widgets or template) and displays a button for adding all the predefined order's items to the cart. You can set for each customer one of his existing orders as perpetual in the customer profile. Then a button will shoe in the shortcode's place for these customers. The customer can now click this button and all the products from the predefined order will be added to the cart. Use [perpetual-order] as the shortcode.
he_il: שכפול הזמנה קבועה מראש שהלקוח יכול להפעיל בהקשה אחת. התוסף יוצר שורטקוד שניתן להציב בכל מקום באתר (ווידג'טים או תבניות) ומציג כפתור להכנסת תוכן ההזמנה הקבועה מראש לעגלת הקניות. הכפתור מוצג רק ללקוחות שמנהל האתר הגדיר עבורם בפרופיל שלהם מספר הזמנה קבועה שאותה יוכל הלקוח לשכפל. השתמש בקוד [perpetual-order]

source: Yehuda Tiram
he_il: יהודה תירם
